from tkinter import *
root = Tk()
root.title("My GUI")
#กำหนดขนาดหน้าจอและตำแหน่ง 
root.geometry("600x200+200+200")#สูง*ยาว+(ตำแหน่งหน้าจอ)x+y

#ใส่ข้อความ 
myLabel = Label(root,text="Hello world",fg="red",font=20,bg="yellow").pack()#กำหนด root เพื่อให้ทำงานแค่ภายใน root
myLabe2 = Label(root,text="Hello world",fg="black",font=40,bg="red").pack()
'''
Tkinter จะกำหนดโครงร่างเพื่อจัดวางวิดเจ็ตลงบนสิ่งที่เรียกว่า คอนเทนเนอร์ (Container) เพื่อจัดการกับตำแหน่งหรือโครงสร้างของปุ่มต่างๆ 
ทำให้เราสามารถวางหรือขยายปุ่มได้ และในบทเรียนนี้เราจะมาพูดถึงการจัดโครงร่างด้วยเมธอด pack() กัน
การจัดโครงร่างด้วยเมธอด pack()
วิดเจ็ตเกือบทั้งหมดของ Tkinter จะต้องมีเมธอด pack() เพื่อใช้ในการกำหนดโครงสร้างของตัวมันเองบนคอนเทอเนอร์ 
เช่น วินโดว์ หรือ เฟรม โดยเมธอดดังกล่าวจะมีออปชัน (Option) หรือคีย์เวิร์ดอาร์กิวเมนต์ สำหรับกำหนดลักษณะการจัดวางดังนี้
'''
root.mainloop()
