import cv2

img = cv2.imread('Python/8_Python_&_OpenCV_Image_Processing/2_OpenCV/test.png')

#แสดงภาพ
cv2.imshow('output',img)

#รอ 5 วิแล้วปิด
cv2.waitKey(delay=5000)

#ปิดหน้าต่างทั้งหมดที่ถูกสร้างโดย cv2.imshow()
cv2.destroyAllWindows()
'''
cv2.destroyAllWindows() เป็นเมธอดในไลบรารี OpenCV (cv2) 
ที่ใช้สำหรับปิดหน้าต่างทั้งหมดที่ถูกสร้างขึ้นโดย OpenCV ในแอพพลิเคชัน Python ของคุณ
เมื่อคุณใช้ cv2.imshow() เพื่อแสดงภาพหรือวิดีโอบนหน้าต่าง, คุณสามารถปิดหน้าต่างนั้นๆ 
โดยการคลิกที่หน้าต่างและกดปุ่ม 'ESC' บนคีย์บอร์ด. อย่างไรก็ตาม, 
ถ้าคุณต้องการปิดหน้าต่างทั้งหมดที่เปิดอยู่โดยไม่ต้องคลิกที่แต่ละหน้าต่าง, คุณสามารถใช้ cv2.destroyAllWindows() เพื่อทำงานนี้ได้.
เมื่อคุณเรียกใช้ cv2.destroyAllWindows(), มันจะปิดหน้าต่างทั้งหมดที่ถูกสร้างโดย cv2.imshow()

หากไม่ใช้ฟังก์ชัน cv2.destroyAllWindows() หน้าต่างทั้งสองหน้าต่างจะยังคงเปิดอยู่จนกว่าโปรแกรมจะสิ้นสุดลง ดังแสดงในภาพด้านล่าง:
รูปภาพหน้าต่างสองหน้าต่างที่เปิดอยู่เปิดในหน้าต่างใหม่
หน้าต่างสองหน้าต่างที่เปิดอยู่
สิ่งนี้อาจส่งผลให้โปรแกรมของคุณใช้หน่วยความจำมากเกินไปและทำงานช้าลง 
ตัวอย่างเช่น หากโปรแกรมของคุณมีหน้าต่างหลายร้อยหน้าต่างเปิดอยู่ 
โปรแกรมของคุณอาจใช้หน่วยความจำจำนวนมากและทำงานช้ามาก
นอกจากนี้ หากคุณลืมปิดหน้าต่างด้วยตนเอง หน้าต่างเหล่านั้นอาจค้างอยู่ 
ซึ่งอาจทำให้โปรแกรมของคุณทำงานผิดปกติ ตัวอย่างเช่น หากคุณเปิดหน้าต่างแล้วลืมปิด 
หน้าต่างนั้นอาจค้างอยู่และไม่สามารถปิดได้
การใช้ฟังก์ชัน cv2.destroyAllWindows() จะช่วยป้องกันปัญหาเหล่านี้ได้ 
โดยช่วยให้คุณล้างหน่วยความจำที่สงวนไว้สำหรับหน้าต่างที่เปิดอยู่ และป้องกันไม่ให้หน้าต่างค้างอยู่'''