#โปรแกรมแลกเงิน
a=int(input("กรอกจำนวนเงิน = "))
if a>1000:
    print("แบงค์พันจำนวน ",a//1000," ใบ")
    a%=1000
if a>500:
    print("แบงค์ห้าร้อยจำนวน ",a//500," ใบ")
    a%=500
if a>100:
    print("แบงค์ร้อยจำนวน ",a//100," ใบ")
    a%=100
if a>50:
    print("แบงค์ห้าสิบจำนวน ",a//50," ใบ")
    a%=50
if a>20:
    print("แบงค์ยี่สิบจำนวน ",a//20," ใบ")
    a%=20
if a>10:
    print("เหรียญสิบบาทจำนวน ",a//10," เหรียญ")
    a%=10
if a>5:
    print("เหรียญห้าบาทจำนวน ",a//10," เหรียญ")
    a%=5
if a>2:
    print("เหรียญสองบาทจำนวน ",a//2," เหรียญ")
    a%=2
if a==1:
    print("เหรียญหนึ่งบาทจำนวน ",a//1," เหรียญ")