'''
Data in python

Primitive
-Booleans  -True
           -False
-String
-Number    -Integer
           -Float
           -Complex
        
'''
'''
จัดกลุ่มข้อมูลพื้นฐาน
LIst = [] , ข้อมูลต่างชนิด , แก้ไขสมาชิกได้ , ข้อมูลซ้ำกันได้ , ข้อมูลซ้ายไปขวา
Tuple = () , ข้อมูลต่างชนิด , แก้ไขสมาชิกได้ไม่ได้(ต้องแปลง) , ข้อมูลซ้ำกันได้ , ข้อมูลซ้ายไปขวา
Set = {} , ข้อมูลต่างชนิด , แก้ไขสมาชิกได้ , ข้อมูลซ้ำกันไม่ได้ , ข้อมูลเรียงลำดับไม่แน่นอน   #set จะใส่ข้อมูลซ้ำกันไม่ได้ จะขึ้นแค่ตัวเดียว
#forzenset คือ ทำให้ set แก้ไขและเพิ่มข้อมูลไม่ได้
'''
