#Fibonacci
#บวกตัวเลขสองตัวหน้าเท่ากับตัวถัดไป   2+3=5
#0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946 ... (ลำดับ OEIS A000045)
def b(a):
    if a<=1:
        return a
    else:
        return b(a-1)+b(a-2)
for i in range(10):
    print(b(i))

print(b(10))

'''
ตัวอย่าง
i = 0
i = 1
i = 2
i = 3
i = 4
i = 5 
if 5 มากกว่า 1 ไป else 
return b(a-1)+b(a-2)
=                        5-1=4                       +                 5-2=3
              4-1=3        +       4-2=2
     3-1=2    +    3-2=1       2-1=1 + 2-2=0                    3-1=2    +    3-2=1
2-1=1 + 2-2=0                       1+0=1                   2-1=1 + 2-2=0 
     1+0=1                                                      1+0=1
              1+1=2                                                    1+1=2
                        2+1=3  
                                                 3+2=5
'''                                     