#ตัวนำเนินการเปรียบเทียบ
#นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
#ชนิดข้อมูลเหมือนกัน
#คำตอบ2คำตอบ=> จริง / เท็จ
a,b,c=1,2,1
print("ค่า a มากกว่า b หรือไม่ : ",a>b)
print("ค่า a น้อยกว่า b หรือไม่ : ",a<b)
print("ค่า a เท่ากับ b หรือไม่ : ",a==b)
print("ค่า a ไม่เท่ากับ b หรือไม่ : ",a!=b)
#หรือ
print("ค่า a มากกว่า หรือ ท่ากับ b หรือไม่ : ",a>=b)
print("ค่า a น้อยกว่า หรือ เท่ากับ b หรือไม่ : ",a<=b)
#และ หากไม่จริงหนึ่งอันจะไม่จริงทั้งหมด
print("ค่า a มากกว่า b และ b มากกว่า c หรือไม่ : ",a>b>c)
print("ค่า a น้อยกว่า b และ b น้อยกว่า c : หรือไม่ : ",a<b<c)
print("ค่า a มากกว่า b และ a มากกว่า c หรือไม่ : ",a>b,a>c)
print("ค่า a มากกว่า b และ a มากกว่า c หรือไม่ : ",a>b,"/",a>c)

