'''
เขียนโปรแกรมเชิงวัถุด้วย python
OOP:Object Oriented Programming

แนวความคิดภาษาเชิงวัตถุ
OOP (Object Oriented Programming)
คือ การเขียนโปรแกรมอีกรูปแบบหนึ่ง โดยมองสิ่งต่างๆเป็น
วัตถุ โดยในวัตถุจะมีคุณสมบัติและพฤติกรรมซึ่งมีมุมมองจาก
พื้นฐานความจริงในชีวิตประจำวัน

เชิงกระบวนการ VS เชิงวัตถุ
    ภาษาเชิงกระบวนการ (Procedural Programming Language)
โปรแกรมจะแบ่งออกเป็นส่วนย่อยๆ เรียกว่าโมดูล (Modyle)
แต่ละโมดูลควรออกแบบให้มีการทำงานเพียง 1 งานูเท่านั้น
การออกแบบให้แต่ละโมดูลมีความเป็นอิสระต่อกันนั้นทำได้ยาก

    ภาษาเชิงวัตถุ (Object Oriented Programming Language)
การพัฒนาโปรแกรมเป็นการเลียนแบบการทำงานเชิงอปเจ็
การออกแบบให้วัตถุมีความเป็นอิสระต่อกันทำได้ง่ายด้วยคุณสมบัติเชิงวัตถุ
สามารถนำโปรแกรมกลับมาใช้ใหม่ (Reuse ได้ดีกว่าภาษาเชิงกระบวนการ

                    เชิงกระบวนการ VS เชิงวัตถุ
ภาษาเชิงกระบวนการ                                ภาษาเชิงวัตถุ
#กำหนดขั้นตอนการแก้ปัญหา                   #กำหนดปัญหาเป็นองค์ประกอบ (วัตถุ)
#โปรแกรมและข้อมูลอยู่คนละส่วนกัน             #เอาส่วนโปรแกรมและข้อมูลไว้ด้วยกัน
#ออกแบบจากล่างขึ้นบน                      #ออกแบบเป็นวัตถุ
#แก้ไขง่ายเพราะแต่ละส่วนไม่มีความสัมพันธ์กัน      #แก้ไขจะไม่กระทบส่วนอื่นๆของ
                                            โปรแกรมเพราะวัตถุจะมีความสมบูรณ์ในตัวเอง

แนวความคิดภาษาเชิงวัตถุ
องค์ประกอบพื้นฐานในภาษาเชิงวัตถุ
1. คลาส (Class) & วัตถุ (Object)
2. , การห่อหุ้ม (Encapsulation)
3. การสืบทอดคุณสมบัติ (Inheritance)
การพ้องรูป (Polymorphism)

คลาส (class) คือุ ต้นแบบของวัตถุการจะสร้างวัตถุขึ้นมาได้จะ
ต้องสร้างคลาสขึ้นมาเป็นโครงสร้างต้นแบบสำหรับวัตถุก่อน
เสมอ
วัตถุหรือออบเจ็ค (object) คือ สิ่งที่ถูกสร้างจากคลาสประกอบ
ด้วยคุณสมบัติ 2 ประการ คือ คุณลักษณะ และ พฤติกรรม

Class     Object
Animal    สิงโต ช้าง วัว ไก่ เต่า

Class         Object
Employee      Accounting Programmer Sale


แนวความคิดภาษาเชิงวัตถุ
คุณลักษณะ (Attribute หรือ Data member) สิ่งที่บ่งบอก
ลักษณะทั่วไปของวัตถุ
พฤติกรรม (Behavior หรือ Method) คือ พฤติกรรมทั่วไป
ของวัตถุที่สามารถกระทำได้

Animal 
ช้าง
คุณสมบัติ (Attribute)
ซื่อ : ช้าง
สี : ฟ้าอ่อน
ประเภท : สัตว์บก
น้ำหนัก : 6 ต้น
จำนวนเท้า : 4 เท้า

พฤติกรรม (Method/Behavior)
- วิ่ง
- นอน
- ส่งเสียงร้อง

Employee
Accounting
Attribute
- ชื่อ
เงินเดือน
Method
คำนวณเงินเดือน
แสดงรายละเอียด

Programmer
Attribute
ชื่อ
เงินเดือน
ประสบการณ์ทำงาน
Method
คำนวณเงินเดือน
- ค่าล่วงเวลา
- แสดงรายละเอียด

Sale
Attribute
เงินเดือน
- เขตพื้นที่รับผิดชอบ
Method
คำนวณเงินเดือน
ค่าคอมมิสชั่น
แสดงรายละเอียด
- ชื่อ

สรุปง่ายๆ
ㆍClass - ต้นแบบของวัตถุ
ㆍ object - สิ่งที่ถูกสร้างขึ้นมาจาก Cเaรs ประกอบด้วย
ㆍ คุณสมบัติ (Attribute)
- พฤติกรรม (Method)
คุมสมบัติของการเขียนโปรแกรมเชิงวัตถุ
0 การห่อหุ้ม(Encapsulation)
ㆍ การสืบทอด (Inheritance)
- การพ้องรูป (POLYMORPHISM)
'''