'''
Access Modifier  คือ ระดับในการเข้าถึง Class, Attribute, MetMod
และอื่น ๆ ในภาษาเชิงวัตถุ โดยมีประโยชน์อย่างมากในเรื่องของการกำหนด
ระดับการเข้าถึง สิทธิในการเข้าใช้งาน การซ้อนข้อมูล และอื่น ๆ
Public เป็นการประกาศระดับการเช้าถึงที่เข้มงวดน้อยที่สุด หรือกล่าวได้ว่าใคร ๆ
ก็สามารถเข้าถึงและเรียกใช้งานได้
Protected (.) เป็นการประกาศระดับการเข้าถึงเฉพาะคลาสของตัวมันเองและ
คลาสลูกที่สืบทอดคุณสมบัติไปใช้เท่านั้น
Private (..) เป็นการประกาศระดับการเข้าถึงที่เข้มงวดที่สุด กล่าวคือ จะมีแต่
คลาสของตัวมันเองเท่านั้นที่มีสิทธิ์ใช้งานได้
'''